source('utils.R')

################################################################################
# 날씨정보 전처리
#  - 결측치에 대해 해당 일 다른 지점들의 평균 값으로 대치
#  - 구로구 결측치에 대해 전날, 다음날의 평균 값으로 대치
################################################################################
pre_proc_weather <- function(df) {
  # 결측치 처리
  df$`일강수량(mm)`[is.na(df$`일강수량(mm)`)] <- 0
  df <- replace_with_mean(df, "평균 풍속(m/s)")
  df <- replace_with_mean(df, "최저기온(°C)")
  df <- replace_with_mean(df, "최고기온(°C)")
  df <- replace_with_mean(df, "평균기온(°C)")
  
  df <- pre_proc_add_guro(df) # 구로구 결측치 삽입 - 2022-06-16, 2022-09-06
  
  return(df)
}

################################################################################
# 대기오염 정보 전처리
#  - 결측치에 대해 0으로 치환
#  - 측정일시를 date type으로 변환
################################################################################
pre_proc_airpolustion <- function(df) {
  # 결측치 처리
  df[is.na(df)] <- 0
  
  # date type
  df$측정일시 <- ymd(df$측정일시)
  
  return(df)
}

################################################################################
# 날씨정보 중 구로구 결측치에 대한 전처리
################################################################################
pre_proc_add_guro <- function(df) {
  guro_data <- list(
    create_guro_data(df, "2022-06-16"),
    create_guro_data(df, "2022-09-06")
  )

  df <- do.call(rbind, c(list(df), guro_data))

  return(df)
}
